app/controllers/profiles_controller.rb

  def search
    if params[:search].present?
      @profiles = Profile.search(params[:search])
---
SELECT `profiles`.* FROM `profiles`

  def index
    @profiles = Profile.all
---
SELECT `profiles`.* FROM `profiles`

  def show
    @reviews = Review.where(profile_id: @profile.id).order("created_at DESC")

    if @reviews.blank?
      @avg_review = 0
    else
      @avg_review = @reviews.average(:rating).round(2)
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`profile_id` = 2 ORDER BY created_at DESC
SELECT AVG(`reviews`.`rating`) FROM `reviews` WHERE `reviews`.`profile_id` = 2

  def create
    @profile = current_user.build_profile(profile_params)


    respond_to do |format|
      if @profile.save
---
INSERT INTO `profiles` (`name`, `address`, `rate`, `created_at`, `updated_at`, `user_id`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES ('jay', 'yu', 56, '2016-07-14 05:07:07', '2016-07-14 05:07:07', 1, 'belt_parkway_small.jpg', 'image/jpeg', 941095, '2016-07-14 05:07:06')

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE `profiles` SET `image_updated_at` = '2016-07-18 11:30:36', `updated_at` = '2016-07-18 11:30:38', `image_file_name` = 'cat_small.jpg' WHERE `profiles`.`id` = 5

  def destroy
    @profile.destroy
---
DELETE FROM `profiles` WHERE `profiles`.`id` = 1

    def set_profile
      @profile = Profile.find(params[:id])
---
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 2 LIMIT 1