app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.profile_id = @profile.id

    respond_to do |format|
      if @review.save
---
INSERT INTO `reviews` (`rating`, `comment`, `created_at`, `updated_at`, `user_id`, `profile_id`) VALUES (2, 'sucked', '2016-07-16 02:08:44', '2016-07-16 02:08:44', 1, 2)

  def destroy
    @review.destroy
---
DELETE FROM `reviews` WHERE `reviews`.`id` = 5

    def set_review
      @review = Review.find(params[:id])
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 5 LIMIT 1

    def set_profile
      @profile = Profile.find(params[:profile_id])
---
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 6 LIMIT 1